Repository: indeyets/midcom
Catalog: com_rohea_facebook/locale/*/LC_MESSAGES/com_rohea_facebook.po
Languages: fi_fi

source: key: Do you use Facebook?
fi_fi: Käytätkö Facebookkia?

source: key: Use Facebook to login for service:
fi_fi: Kirjaudu palveluun Facebook-tunnustesi avulla.

source: key: We just need a little more info of you. This will be asked one time only.
fi_fi: Tarvitsemme hieman lisätietoa sinusta. Nämä tiedot kysytään vain kerran!

source: key: Login with your existing account to connect it to Facebook
fi_fi: Kirjaudu sisään olemassa olevalla tunnuksellasi liittääksesi sen Facebookkiin

source: key: Username
fi_fi: Käyttäjätunnus

source: key: User interface language
fi_fi: Käyttöliittymäkieli

source: key: Default writing language
fi_fi: Pääasiallinen kirjoituskieli

source: key: Password
fi_fi: Salasana

source: key: Retype password
fi_fi: Kirjoita salasana uudelleen

source: key: New user to service
fi_fi: Uusi käyttäjä

source: key: I've used this service before
fi_fi: Olen käyttänyt tätä palvelua aiemminkin

source: key: Register your account
fi_fi: Rekisteröi tunnuksesi

source: key: Welcome
fi_fi: Tervetuloa

source: key: Register now
fi_fi: Rekisteröidy nyt!

source: key: Forgot password?
fi_fi: Unohtuiko salasanasi?

source: key: What is Qaiku?
fi_fi: Mikä on Qaiku?

source: key: Invite Friends!
fi_fi: Kutsu kavereita!

source: key: Contiune registration
fi_fi: Jatka rekisteröitymistä

source: key: Contiune Registration
fi_fi: Jatka rekisteröitymistä

source: key: Logged in to Facebook
fi_fi: Kirjaudu Facebookiin

source: key: Your location
fi_fi: Sijaintisi

source: key: At least 6 characters
fi_fi: Vähintään 6 merkkiä

source: key: username needed
fi_fi: Valitse käyttäjätunnus

source: key: Username can contain
fi_fi: Käyttäjätunnus voi sisältää:

source: key: characters
fi_fi: merkkejä

source: key: is already in use
fi_fi: on jo käytössä

source: key: at least
fi_fi: vähintään

source: key: password fields are equal
fi_fi: Salasanakenttien sisällön pitää olla sama

source: key: choose one
fi_fi: Valitse yksi

source: key: email needed
fi_fi: sähköpostiosoite tarvitaan

source: key: incorrect email
fi_fi: Vääränmuotoinen sähköposti
