Repository: indeyets/midcom
Catalog: com_rohea_account/locale/*/LC_MESSAGES/com_rohea_account.po
Languages: fi_fi

source: key: Close
fi_fi: Sulje

source: key: Remember login
fi_fi: Muista kirjautuminen

source: key: Settings of ${username}
fi_fi: ${username} tunnuksen asetukset

source: key: Logged in as ${username}
fi_fi: Kirjautunut tunnuksella ${username}

source: key: Here you can modify your user settings
fi_fi: Voit muokata täällä käyttöasetuksiasi.

source: key: Username
fi_fi: Tunnus

source: key: username_info
fi_fi: Valitettavasti käyttäjätunnuksen vaihtaminen ei ole mahdollista.

source: key: Delete
fi_fi: Poista

source: key: Add
fi_fi: Lisää

source: key: - Select -
fi_fi: - Valitse -

source: key: User interface language
fi_fi: Käyttöliittymän kieli

source: key: ui_language_info
fi_fi: Valitse käyttöliittymän kieli

source: key: Default writing language
fi_fi: Pääasiallinen kirjoituskieli

source: key: Location
fi_fi: Sijainti

source: key: Save
fi_fi: Tallenna

source: key: location_info
fi_fi: Valitse maa jossa asut

source: key: Password
fi_fi: Salasana

source: key: Native language
fi_fi: Kieli

source: key: New password
fi_fi: Uusi salasana

source: key: Retype new password
fi_fi: Kirjoita salasana uudelleen

source: key: Change
fi_fi: Vaihda

source: key: email_address
fi_fi: Sähköpostiosoite

source: key: Create account
fi_fi: Luo tunnus

source: key: captcha info
fi_fi: Viimeiseksi meidän täytyy varmistua että olet ihminen etkä ilkeä tietokonebotti. Kirjoitathan allaolevat kaksi sanaa annettuun tilaan.

source: key: Register your account
fi_fi: Rekisteröi tunnuksesi

source: key: Your location
fi_fi: Sijaintisi

source: key: Username can contain
fi_fi: Käyttäjätunnus voi sisältää vain kirjaimia (A-Z ja a-z), numeroita (0-9) ja tavuviivan (-). Huom! Valitettavasti skandinaaviset kirjaimet eivät kelpaa.

source: key: Email lost password
fi_fi: Sähköpostin avulla voimme lähettää sinulle tunnuksen ja salasanan, jos ne pääsevät unohtumaan.

source: key: At least 6 characters
fi_fi: Vähintään 6 merkkiä

source: key: Retype password
fi_fi: Salasana uudelleen

source: key: Receive beta ending notification
fi_fi: Vastaanota ilmoitus beta-testauksen päättymisestä

source: key: registration beta notification
fi_fi: Palvelu beta-testausvaiheessa. Ymmärrämme, etteivät kaikki välitä käyttää palvelua, josta saattaa parhaista pyrkimyksistä huolimatta esiintyä pieniä hikotteluja aina silloin tällöin. Jos ruksit viereisen laatikon, lähetämme sinulle yhden sähköpostin kun palvelu poistuu testausvaiheesta

source: key: Register
fi_fi: Rekisteröidy

source: key: incorrect email
fi_fi: Kirjoita sähköpostiosoite oikein. Sähköpostin avulla voimme lähettää sinulle tunnuksen ja salasanan, jos ne pääsevät unohtumaan.

source: key: choose one
fi_fi: Valitse yksi

source: key: email needed
fi_fi: Tarvitaan

source: key: username needed
fi_fi: Valitse käyttäjätunnus

source: key: at least
fi_fi: Vähintään

source: key: max
fi_fi: Enintään

source: key: characters
fi_fi: merkkiä

source: key: password fields are equal
fi_fi: Salasanakenttien sisällön pitää olla sama

source: key: is already in use
fi_fi: on jo käytössä

source: key: Order new password
fi_fi: Tilaa uusi salasana

source: key: Order
fi_fi: Tilaa

source: key: Error
fi_fi: Virhe!

source: key: A user with given username and e-mail was not found.
fi_fi: Kyseisellä käyttäjätunnuksella ja sähköpostilla ei löydy yhtään käyttäjää.

source: key: Success
fi_fi: Onnistui!

source: key: User interface language changed
fi_fi: Käyttöliittymän kieli vaihdettu.

source: key: Primary language changed
fi_fi: Oletuskieli vaihdettu.

source: key: A new password has been sent to you.
fi_fi: Uusi salasana on lähetetty sähköpostilla.

source: key: forgot password email subject
fi_fi: Uusi salasana

source: key: new password mail
fi_fi: Hei! Alta löydät uuden väliaikaisen salasanasi. Muista vaihtaa se sisään kirjautumisen jälkeen.

source: key: new password mail regards
fi_fi: Ystävällisin terveisin, ylläpito

source: key: Remember me
fi_fi: Muista minut

source: key: Your password has been changed
fi_fi: Salasanasi on vaihdettu

source: key: Login
fi_fi: Tervetuloa, kirjaudu palveluun!

source: key: Sign in
fi_fi: Kirjaudu

source: key: settings
fi_fi: Yhteenveto

source: key: settings_email
fi_fi: Vaihda sähköpostisoite

source: key: settings_avatar
fi_fi: Vaihda käyttäjäkuva

source: key: settings_languages
fi_fi: Kieliasetukset

source: key: settings_password
fi_fi: Vaihda salasana

source: key: Old password
fi_fi: Vanha salasana

source: key: Send
fi_fi: Lähetä

source: key: Modify
fi_fi: Muokkaa

source: key: Cancel
fi_fi: Obs, peru

source: key: Choose
fi_fi: Valitse

source: key: settings_overview
fi_fi: Näkymävalinnat

source: key: Forgot password?
fi_fi: Unohtuiko salasanasi?

source: key: Send feedback
fi_fi: Lähetä meille palautetta!

source: key: Register now
fi_fi: Rekisteröidy nyt!

source: key: login failed
fi_fi: Kirjautuminen epäonnistui.

source: key: login failed message
fi_fi: Tarkista käyttäjätunnus ja salasanasi.

source: key: Firstname
fi_fi: Etunimi

source: key: Surname
fi_fi: Sukunimi

source: key: E-mail address changed
fi_fi: Sähköpostiosoite vaihdettu

source: key: Password has been changed
fi_fi: Salasana vaihdettu

source: key: edit successfull
fi_fi: Onnistui!

source: key: Failure
fi_fi: Epäonnistui!

source: key: Password change failed
fi_fi: Salasanaa ei vaihdettu. Tarkista että kirjoitit vanhan salasanasi ja uuden salasanan kaksi kertaa oikein.

source: key: Surname needed
fi_fi: Kirjoita etunimesi

source: key: Lastname needed
fi_fi: Kirjoita sukunimesi

source: key: Homephone
fi_fi: Kotipuhelin

source: key: Streetaddress
fi_fi: Katuosoite

source: key: Postalcode
fi_fi: Postinumero

source: key: City
fi_fi: Kaupunki

source: key: Additional information
fi_fi: Lisätietoa

source: key: Mandatory fields
fi_fi: Pakolliset tiedot

source: key: Additional fields
fi_fi: Lisätiedot
